test/fixtures/xml/fedex/pickup_raw.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/pickup/v10">
   <SOAP-ENV:Body>
      <CreatePickupRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key>THMNl2nJQBc0U41y</Key>
               <Password>Fj7tkfla7Hpou1JUNTbKSO6aF</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>342914012</AccountNumber>
            <MeterNumber>106259821</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>*** Create Pickup Request v10 ***</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>disp</ServiceId>
            <Major>10</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <OriginDetail>
            <PickupLocation>
               <Contact>
                  <PersonName>Esteban</PersonName>
                  <CompanyName>Comcom</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Blas Pascal 126</StreetLines>
                  <City>Mexico DF</City>
                  <StateOrProvinceCode>DF</StateOrProvinceCode>
                  <PostalCode>11550</PostalCode>
                  <CountryCode>MX</CountryCode>
               </Address>
            </PickupLocation>
            <PackageLocation>FRONT</PackageLocation>
            <BuildingPartDescription></BuildingPartDescription>
            <ReadyTimestamp>2014-11-18T13:30:00+05:30</ReadyTimestamp>
            <CompanyCloseTime>20:00:00</CompanyCloseTime>
         </OriginDetail>
         <PackageCount>1</PackageCount>
         <TotalWeight>
            <Units>KG</Units>
            <Value>1.0</Value>
         </TotalWeight>
         <CarrierCode>FDXE</CarrierCode>
      </CreatePickupRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>